---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightFamily.GetLightShapeStyle
source: html/4f4a02a9-f875-c9cf-dc27-d686ffaabc7e.htm
---
# Autodesk.Revit.DB.Lighting.LightFamily.GetLightShapeStyle Method

Returns a LightShapeStyle value for the light shape

## Syntax (C#)
```csharp
public LightShapeStyle GetLightShapeStyle()
```